let subjectArr = [
'TV 작동방법은 어떻게 되나요?', 
'예약한 룸 타입과 달라 객실구조가불편하여이용이어려워요', 
'객실 내 소음문제가 발생했어요', 
'객실 내 쓰레기가 발생했는데 어디에 놔둬야하나요?', 
'객실마다 커피머신과 셋팅되는 커피가 있을까요?', 
'객실에 문제가 발생하여 이용이 어려워요.(청소가깨끗하게되지않았어요등)', 
'에어컨 작동이 안돼요.', 
'일회용품(어메니티) 및 물 요청 및 구입 할 수 있나요?', 
'객실 내 커피포트가 있나요?', 
'티비에 문제가 있는거 같아요 (안켜져요등)', 
'흡연이 가능한가요?', 
'근처 24시간 영업하는 편의점이 있나요?', 
'비상시 탈출 경로가 어떻게 되나요?', 
'TV와 스마트폰 미러링 이용이 가능한가요?', 
'넷플릭스 시청이 가능한가요?', 
'수영장 이용 요금이 어떻게 되나요?', 
'수영장만 이용가능 한가요?', 
'와이파이 사용이 가능한가요?', 
'객실 수건/타월 추가 가능한가요?', 
'수영장 이용 시간과 이용 방법이 궁금해요.', 
'식수/ 물 추가로 더 필요해요.', 
'아기이유식 전자레인지 이용 가능한가요?', 
'아이스 버킷과 디저트 스푼 이용이 가능한가요?', 
'엑스트라 베드 및 침구류 추가 가능한가요?', 
'외국인 방문 시 대응방법.', 
'우천시 수영장 이용 문의?', 
'자판기(물, 일회용품) 고장으로 사용이 어려운데 어떻게 하나요?', 
'조식은 언제 어디서 먹을 수 있나요?', 
'주차는 어디에 해야하나요?', 
'주취자에 대한 대응?', 
'추가 비품 제공이 가능한가요? 보조배터리가 있나요?', 
'피트니스 센터 이용 시간과 이용 방법이 궁금해요.', 
'휴대폰 충전기를 이용할 수 있나요?', 
'응급(긴급) 상황 발생 시 누구에게 연락해야 하나요?', 
'제가 예약한 객실에 이미 예약이 되어있어요 or예약한객실이없어요.', 
'객실 예약 인원 추가 변경이 가능한가요?', 
'객실 요금 할인 해주실 수는 없나요?', 
'객실 이용시간(퇴실시간) 연장이 가능한가요? (숙박후대실으로연장하여이용이가능한가요?)', 
'애완동물 동반 이용이 가능한가요?', 
'야간 시간에도 대실이 가능한가요?', 
'연박(장기숙박) 고객의 경우에는 어떻게 하나요?', 
'예약하고 싶은데 어떻게 하나요?', 
'지금 방문하면 얼마인가요?', 
'예약 플랫폼에서 예약 후 객실 등급과 비용 불만이 발생하였을 경우?', 
'예약 했는데, 예약내역 조회가 안돼요.', 
'미수금 카드 결제 가능한가요?', 
'퇴실(체크아웃) 시간이 어떻게 되나요?', 
'예약 했는데 캐리어 보관이 가능한가요?', 
'입실(체크인) 시간이 어떻게 되나요?', 
'조기입실이 가능한가요?', 
'체크인 전에 주차장이용 후 입실이 가능한가요?', 
'객실 키 추가로 하나 더 발급이 가능한가요?', 
'객실 키가 안되는데 새로 발급 받을 수 있나요?', 
'키오스크 결제가 안되고 오류가 발생했어요', 
'키오스크 키발행 안되고 오류가 발생했어요', 
'키오스크에서 결제했는데 영수증만 나오고 키는 안 나왔어요', 
'퇴실 이후 개인소지품 확인?', 
'객실 키 분실 또는 소지자가 외부에 있어 하나 더 발행 요청', 
'환불 정책이 어떻게 되나요?'
]

let contentArr = [
'리모콘으로 작동 가능하며, 객실 내 지니서비스도 가능. (지니야, TV켜 등) 외부입력-기가지니로변경후사용이가능하며,해당서비스불가시객실변경으로안내.', 
'고객이 예약한 객실 확인 후 어떤 부분이 불편한지 파악 후 응대 간혹침대가늘어나지만쇼파가없어서불편할수있음.다른유형의객실으로변경하여별도서비스로고객대응필요.', 
'고객에게 양해 안내 후 원인이 되는 객실으로 연락하여 조치를 취한다. 컴플레인이있을경우객실변경', 
'객실 문 앞에 놓아주시면 수거가 용이함으로 안내', 
'네스프레소 커피머신과 커피캡슐 2개, 티백4개 구비 되어있음.', 
'어떤 문제가 발생하였는지 확인하여 정중하게 사과 드린 후 제공 가능한 가장 좋은 객실으로 변경', 
'온도 조절기 위치안내 (화장실 문 옆에 위치). 시설문제로 확인되면 양해 후 객실 변경', 
'샴푸, 린스, 바디 외 제공은 법 개정으로 인해 불법이므로 1층 자판기에서 판매중으로 구매 안내. 저녁11시이후부터컨시어지서비스가운영되지않아원하시는물품을객실까지가져다드리기어려운점양해안내.', 
'객실 내 커피머신 하단 서랍장 내 있음 안내.', 
'셋탑박스 재부팅 안내문제가있을경우현재컨시어지서비스종료로방문확인이어려운점양해안내.', 
'전객실 및 건물 내 불가능 / 1층 후문 왼편에 흡연가능하게 휴지통 비치되어있음 안내.', 
'도보 5분 거리에 GS25 편의점이 있으나, 현재 영업중인지 여부는 알 수 없으므로 직접 확인하여 방문 안내.', 
'', 
'객실내 준비된 시스템은 미러링 서비스를 지원하지 못하고 있으며, KT 넷플릭스는 시청이 가능함.', 
'HDMI 1번 맞추고 홈버튼 누르면 KT메뉴에 넷플릭스 표시되어 사용가능함. KT셋탑을통해넷플릭스(개인계정이용) 넷플릭스제외한타ott는사용이불가능', 
'대실 상품 및 비즈니스 및 디럭스 객실의 경우 1인당 3만원 추가요금 발생 프리미어이상객실의경우2인포함', 
'객실을 이용하는 손님을 위한 서비스 시설으로 수영장만은 이용불가. 대실 상품에 금액 추가하여 이용하실 수 있음.', 
'호실 이름으로 전 객실 와이파이 제공(비밀번호 없음)', 
'객실 내 비치된 물품 이외에 추가요청은 별도 비용 발생안내. 수건 2,000원/ 바디타월 5,000원. 야간에요청하실경우밤11시부터컨시어지서비스가운영되지않아원하시는물품제공어려움양해안내.', 
'5월부터 10월까지 미온수로 운영 / 인피니티풀 패키지 포함 상품으로 예약하면 이용 가능 / 10층에서 오전10시~오후10시까지 이용가능 수영장에는수건및바디타월이별도비치되어있지않아객실에서챙겨서사용', 
'객실 내 냉장고에 물 3명 분 비치되어 있음. 추가로 이용을 원하시면 호텔 내 1층 자판기에서 판매 중. 간단한이용을위해서2층카페테리아안쪽에마련된정수기도있음안내.', 
'', 
'사전에 예약된 물품이 아니면 추가로 준비가 어려움 안내', 
'엑스트라 베드는 1대당 3만원이며, 밤 11시 이후에는 무인 관제 중으로 컨시어지 서비스 종료로 제공 불가능 양해 안내.', 
'키오스크내의 외국어 버전 안내. 고객 문의 사항에 대해서 번역어플 이용하여 안내.', 
'', 
'', 
'오전 8시 부터 오전 10시까지 1층 카페에서 제공 / 크로아상조식과 음료 제공 / 전 객실 인원 수만큼 조식 제공 당일예약인원에맞춰제공해드리는거라조식추가및시간외사용불가양해안내.', 
'건물 뒷편 지하주차장, 건물 양 옆 지상주차장 안내.', 
'', 
'컨시어지 서비스가 종료되어 추가 비품은 1층 자동판매기물품 목록 안내. 핸드폰보조배터리는따로없음', 
'9층에서 이용가능 / 오전 7시 30분 부터 오후 9시까지 이용 가능 / 전객실 투숙객 무료 이용 가능', 
'', 
'', 
'객실청소 진행중으로 안내하고 잔여 객실 확인하여 상급 객실로 변경 안내', 
'1인당 추가비 4만원. 다만 예약취소 후 재예약이 고객입장에서 더 저렴할 수 있음 안내.', 
'객실 요금표의 할인가능한 기준 내에서 응대', 
'1시간 당 1만원 (퇴실 시 키오스크 키 반납시 결제 표시되면 결제안내) (같은객실에서대실요청시에요금안내후호텔으로메모전달)', 
'이용불가', 
'밤 11시 이후 대실 불가/ 대실은 오후 7시까지 이용가능 대실시간은5시간이며,17시대실마감으로예약시간에따라이용시간은달라질수있음.', 
'1일 단위로 키오스크에서 도어락키 재발행 해드려야함. 재실 청소 및 객실 비치 소품에 대한 안내 필요.', 
'현재 예약실 업무 종료로 인하여 오전 8시부터 오후 11시까지 예약가능 시간에 전화 해달라 안내', 
'요금표 확인 후 안내. ', 
'예약된 객실의 등급과 비용 확인 후 안내. 플랫폼의 특성에 따라 예약되는 비용이 플랫폼에 따라 달라질 수 있음.(해당컴플레인은플랫폼에연락후조치받아야한다안내) (호텔에서해줄수있는최선의조치는룸업그레이드이다.)', 
'야놀자 등 예약연동 안되는 경우가 있을 수 있음. 별도 사이트 확인 후 예약생성으로 대처 필요.', 
'키오스크에서 할 수 있음. 작동 불가시에 미수금으로 표기후 내용 공유. 별도 계좌이체를 위한 정보??', 
'플랫폼 예약 시 예약상품에 따라 다름. 현장 결제 또는 현장 예약은 오전 11시 체크아웃.', 
'1층 카페 쪽으로 러거지 보관위치 안내', 
'플랫폼 예약 시 예약상품에 따라 다르며, 현장 결제 또는 현장 예약은 오후 4시 체크인.', 
'객실 이용 기준시간 안내, 추가로 요청하시고자 하는 시간만큼 대실결제로 가능. 1개당 5시간.', 
'주차장 이용가능, 예상되는 입실시간 확인', 
'', 
'1층 로비 방문해주시면 키오스크 통하여 추가 발급 안내 추가발급시먼저발행된카드는사용불가로양해안내.', 
'인근 키오스크 이용 안내. 부득이한 경우에는 익일 카운터를 통한 결제 요청. 미수금 기록.', 
'오류발생 키오스크 외 다른 장비에서 키발행 도움 안내', 
'인근 키오스크에서 예약확인 후 키발행', 
'해당 객실키 발행하여 물품 확인 후 조치', 
'예약자 이름으로 신원 확인 후에 키발행 가능', 
'플랫폼 예약 시 플랫폼의 환불 정책에 따라 다르다. 전화 예약 시 내부기준? 안내.'
]

let keyWord =[]
let subject = []
let keyWordEl = document.querySelector(".key_word");
keyWordEl.addEventListener("keydown",(e)=> {
    if(e.key === 'Enter') {
        document.querySelector(".subject").innerHTML=''
        document.querySelector('.content').innerHTML=''
        keyWord = [keyWordEl.value]
        let subjects = subjectArr.filter(e => e.includes(keyWord))
        subject = [...subjects]
        keyWordEl.value=""
        for(i=0; i<subject.length; i++) {
            let pEl = document.createElement("p");
            pEl.innerText = subject[i];
            pEl.addEventListener('click', e => {
                document.querySelector('.content').innerHTML=''
                console.log(subjectArr.indexOf(e.target.innerText))
                let pEl2 = document.createElement("p");
                pEl2.innerText = contentArr[subjectArr.indexOf(e.target.innerText)]
                document.querySelector('.content').append(pEl2)

            })
            document.querySelector(".subject").append(pEl)
        }
       
    }
})

